// Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка)


int A;                             
Console.Write("Введите число: ");
A= Console.Read();

if (A % 2==0)
{
Console.WriteLine("Число четное");

}
else
{
Console.WriteLine("Число нечетное");
}
Console.WriteLine("Hello, World!");
